Repository: flyeblue/opencv401
Catalog: omegat/project_save.tmx
Source language: en_us
Languages: zh

source: They will be highly useful while extracting any part of the image (as we will see in coming chapters), defining and working with non-rectangular ROI etc.
zh: 它们在提取图像的任何部分时非常有用（我们将在后面的章节中看到），定义和处理非矩形ROI等。

source: This algorithm transforms image to contrast using gradients on all levels of gaussian pyramid...
zh: 该算法使用各级高斯金字塔上的梯度将图像转换为对比度。..

source: This algorithm was brought up by Ethan Rublee, Vincent Rabaud, Kurt Konolige and Gary R. Bradski in their paper ORB: An efficient alternative to SIFT or SURF in 2011.
zh: 该算法由Ethan Rublee，Vincent Rabaud，Kurt Konolige和Gary R. Bradski在他们的论文中提出。 ORB: An efficient alternative to SIFT or SURF in 2011.

source: This also makes it easier to integrate with other libraries that use Numpy such as SciPy and Matplotlib.
zh: 这也使得与使用Numpy的其他库（如SciPy和Matplotlib）集成更容易。

source: This class is templated with the type of elements for which the index is built.
zh: 此类使用为其构建索引的元素类型进行模板化.

source: This compactness is returned as output.
zh: 该紧凑性作为输出返回。

source: This each sub-part is called "BIN".
zh: 每个子部分称为“BIN”。

source: This function is more appropriate for tracking.
zh: 此功能更适合跟踪.

source: This function takes following arguments:
zh: 此函数采用以下参数:

source: This gaussian filter is a function of space alone, that is, nearby pixels are considered while filtering.
zh: 该高斯滤波器仅是空间的函数，即，在滤波时考虑附近的像素.

source: This gives us the compactness, labels and centers.
zh: 这为我们提供了紧凑性，标签和中心。

source: This gives us two advantages: first, the code is as fast as the original C/C++ code (since it is the actual C++ code working in background) and second, it easier to code in Python than C/C++.
zh: 这给我们带来了两个好处：首先，代码与原始C / C ++代码一样快（因为它是在后台工作的实际C ++代码），其次，在Python中编写代码比使用C / C ++更容易。

source: This includes bitwise AND, OR, NOT and XOR operations.
zh: 包括位运算 AND, OR, NOT 和 XOR。

source: This information is sufficient to find the object exactly on the trainImage.
zh: 此信息足以在trainImage上准确找到对象。

source: This is a base class for all more or less complex algorithms in OpenCV.
zh: 这是 OpenCV 所有或复杂或简单算法的基础类.

source: This is already available with OpenCV-Python2 official samples.
zh: 这已经在OpenCV-Python2官方样本中提供。

source: This is also image addition, but different weights are given to images so that it gives a feeling of blending or transparency.
zh: 这也是图像加法，但是对图像赋予不同的权重，从而给出混合感或透明感。

source: This is done by convolving image with a normalized box filter.
zh: 这是通过将图像与标准化的盒式过滤器进行卷积来完成的.

source: This is done by the function cv.blur() or cv.boxFilter().
zh: 实现这个功能的函数是 cv.blur() or cv.boxFilter().

source: This is highly effective against salt-and-pepper noise in the images.
zh: 这对图像中的椒盐噪声非常有效.

source: This is the "philosophy" behind the watershed.
zh: 这是分水岭背后的“哲学”.

source: This is the third argument in cv.findContours function.
zh: 这是cv.findContours函数的第三个参数.

source: This is what cv.CHAIN_APPROX_SIMPLE does.
zh: 这就是 cv.CHAIN_APPROX_SIMPLE 的作用.

source: This normally improves the contrast of the image.
zh: 这通常可以改善图像的对比度。

source: This process is called tonemapping.
zh: 此过程称为色调映射.

source: This representation is used in OpenCV).
zh: 此表示形式用于OpenCV）。

source: This time, we see significantly better algorithms like "Meanshift", and its upgraded version, "Camshift" to find and track them.
zh: 这一次，我们看到明显更好的算法，如“Meanshift”，及其升级版本，“Camshift”来查找和跟踪它们.

source: This tutorial was originally started by Abid Rahman K. as part of the Google Summer of Code 2013 program under the guidance of Alexander Mordvintsev.
zh: 本教程由Abid Rahman K. as part of the Google Summer of Code 2013 program under the guidance of Alexander Mordvintsev.

source: This way, we can make sure whatever region in background in result is really a background, since boundary region is removed.
zh: 这样，我们可以确保结果中背景中的任何区域确实是背景，因为边界区域被移除。

source: To avoid that, you build barriers in the locations where water merges.
zh: 为避免这种情况，您需要在水合并的位置建立障碍.

source: To combine these exposures it is useful to know your camera’s response function and there are algorithms to estimate it.
zh: 要结合这些曝光，了解相机的响应函数是有用的，并且有估算它的算法。

source: To draw all contours, pass -1) and remaining arguments are color, thickness etc.
zh: 要绘制所有轮廓，请传递-1），其余参数是颜色，厚度等.

source: To draw all the contours in an image:
zh: 绘制图像中的所有轮廓:

source: To draw an individual contour, say 4th contour:
zh: 要绘制单个轮廓，请说出第4个轮廓:

source: To draw the contours, cv.drawContours function is used.
zh: 用 cv.drawContours 函数画出轮廓.

source: To find histogram of full image, it is given as "None".
zh: 计算整个图片的立方图，则设置为 "None".

source: To improve the rotation invariance, moments are computed with x and y which should be in a circular region of radius \(r\), where \(r\) is the size of the patch.
zh: 为了改善旋转不变性，使用x和y计算矩，该y和y应该在半径为\（r \）的圆形区域中，其中\（r \）是补丁的大小。

source: To remove any small holes in the object, we can use morphological closing.
zh: 要移除对象中的任何小孔，我们可以使用形态学闭合.

source: To represent that, they also add 256 at end of bins.
zh: 为了表示这一点，他们还在箱柜末尾添加了256个。

source: To resolve all these, ORB runs a greedy search among all possible binary tests to find the ones that have both high variance and means close to 0.5, as well as being uncorrelated.
zh: 为了解决所有这些问题，ORB在所有可能的二进制测试中进行贪婪搜索，以找到具有高方差和意味着接近0.5的那些，以及不相关的。

source: To solve this problem, algorithm uses RANSAC or LEAST_MEDIAN (which can be decided by the flags).
zh: 为了解决这个问题， 算法使用 RANSAC 或者 LEAST_MEDIAN (这个由flags设置).

source: Total number of pixels is accessed by img.size:
zh: 总像素数可以通过 img.size获得:

source: Tracking API
zh: 跟踪轨迹API

source: True if initialization went succesfully, false otherwise
zh: 初始化成功返回True, 其他返回False

source: True means that target was located and false means that tracker cannot locate target in current frame.
zh: True 意味着标记目标成功，False 则是失败，在当前帧

source: Try below code:
zh: 试试下面的代码:

source: Try it
zh: 试一下

source: Try this code and check the result:
zh: 试下面的代码并检查结果:

source: Understand what contours are.
zh: 理解什么是轮廓.

source: Understanding Parameters
zh: 了解参数

source: Understanding SVM
zh: 理解 SVM

source: Until then, the values given to them in code sample will work fine for all images.
zh: 在此之前，代码示例中给出的值将适用于所有图像.

source: Update the tracker, find the new most likely bounding box for the target.
zh: 更新跟踪器, 寻找更多包含类似目标的区域.

source: Upto 255 is sufficient.
zh: 255就足够了

source: Use exposure fusion to merge an exposure sequence.
zh: 使用曝光融合来合并曝光序列。

source: Using Matplotlib
zh: 使用Matplotlib

source: Using OpenCV
zh: 使用 OpenCV

source: Video Analysis
zh: 视频分析

source: Warning
zh: 警告

source: Watershed algorithm should find it.
zh: 分水岭算法应该找到它。

source: We again use the same mask to do it.
zh: 我们再次使用相同的掩码来完成它.

source: We already saw that gaussian filter takes the a neighbourhood around the pixel and find its gaussian weighted average.
zh: 我们已经看到高斯滤波器采用像素周围的邻域并找到其高斯加权平均值.

source: We also do not need to use any tonemap algorithm because the Mertens algorithm already gives us the result in the range of [0..1].
zh: 我们也不需要使用任何色调图算法，因为Mertens算法已经给出了[0..1]范围内的结果。

source: We also should specify the standard deviation in X and Y direction, sigmaX and sigmaY respectively.
zh: 我们还应分别指定X和Y方向的标准偏差，sigmaX和sigmaY.

source: We call it border.
zh: 我们称之为边界.

source: We can find these parameters using a mask image.
zh: 我们可以使用掩模图像找到这些参数.

source: We get following image :
zh: 我们获得下面的图片：

source: We have already seen an example of color-based tracking.
zh: 我们已经看到了基于颜色的跟踪的示例.

source: We have seen that there can be some possible errors while matching which may affect the result.
zh: 我们已经看到匹配时可能存在一些可能的错误，这可能会影响结果。

source: We map the 32-bit float HDR data into the range [0..1].
zh: 我们将32位浮点HDR数据映射到范围[0..1].

source: We should specify the width and height of kernel which should be positive and odd.
zh: 我们应该指定内核的宽度和高度，它应该是正数和奇数.

source: We should specify the width and height of kernel.
zh: 我们应该指定内核的宽度和高度.

source: We start with finding an approximate estimate of the coins.
zh: 我们首先找到硬币的近似估计值.

source: We use the function: cv.equalizeHist (src, dst)
zh: 我们使用函数: cv.equalizeHist (src, dst)

source: We used cv.calcHist() to find the histogram of the full image.
zh: 我们使用 cv.calcHist() 计算整幅图的直方图

source: We used a queryImage, found some feature points in it, we took another trainImage, found the features in that image too and we found the best matches among them.
zh: 我们使用了queryImage，在其中找到了一些特征点，我们采用了另一个trainImage，找到了该图像中的特征，我们发现它们之间的最佳匹配。

source: We will discuss second and third arguments and about hierarchy in details later.
zh: 我们稍后将详细讨论第二和第三个参数以及层次结构.

source: We will learn about the another corner detector: Shi-Tomasi Corner Detector
zh: 我们将了解另一个角落探测器：Shi-Tomasi角落探测器

source: We will learn the concepts of histogram equalization and use it to improve the contrast of our images.
zh: 我们将学习直方图均衡的概念，并用它来改善图像的对比度。

source: We will learn to use marker-based image segmentation using watershed algorithm
zh: 我们将学习使用分水岭算法使用基于标记的图像分割

source: We will mix up the feature matching and findHomography from calib3d module to find known objects in a complex image.
zh: 我们将混合来自calib3d模块的特征匹配和findHomography来查找复杂图像中的已知对象。

source: We will see how it works for a line.
zh: 我们将弄明白怎么找线

source: We will see how to use it to detect lines in an image.
zh: 我们将看到如何使用它来检测图像中的线条。

source: We will see that when its time comes.
zh: 我们会看到它到来的时候.

source: We will see the basics of ORB
zh: 我们将弄明白ORB的基本用法

source: We will see the following functions: cv.HoughLines(), cv.HoughLinesP()
zh: 我们将弄明白以下函数： cv.HoughLines()，cv.HoughLinesP()

source: We will see the function: cv.goodFeaturesToTrack()
zh: 我们将弄明白: cv.goodFeaturesToTrack()

source: We will see: cv.watershed()
zh: 我们将弄墨那个白: cv.watershed()

source: We will understand the concept of the Hough Transform.
zh: 我们将理解霍夫变换的概念。

source: Well, here you adjust the values of histograms along with its bin values to look like x,y coordinates so that you can draw it using cv.line() or cv.polyline() function to generate same image as above.
zh: 那么，在这里你可以调整直方图的值及其bin值，使其看起来像x，y坐标，这样你就可以使用 cv.line() 或者 cv.polyline() 函数去跟上面类似的图片。

source: What are contours?
zh: 什么是轮廓?

source: What does it denote actually?
zh: 它实际上表示什么?

source: What if you want to find histograms of some regions of an image?
zh: 如果要查找图像某些区域的直方图，该怎么办？

source: What we do is to give different labels for our object we know.
zh: 我们所做的是为我们知道的对象提供不同的标签.

source: When a face is obtained, we select the face region alone and search for eyes inside it instead of searching the whole image.
zh: 当获得面部时，我们单独选择面部区域并在其内部搜索眼睛而不是搜索整个图像.

source: When this criteria is satisfied, algorithm iteration stops.
zh: 满足此条件时，算法迭代停止。

source: When we take photographs of a real world scene, bright regions may be overexposed, while the dark ones may be underexposed, so we can’t capture all details using a single exposure.
zh: 当我们拍摄现实世界场景的照片时，明亮区域可能曝光过度，而暗区域可能曝光不足，因此我们无法使用单次曝光捕捉所有细节。

source: While the human eye can adjust to a wide range of light conditions, most imaging devices use 8-bits per channel, so we are limited to only 256 levels.
zh: 虽然人眼可以适应各种光线条件，但大多数成像设备每通道使用8位，因此我们仅限于256级。

source: With all this information, the function finds corners in the image.
zh: 通过所有这些信息，该函数可以在图像中找到角点.

source: Yes, SIFT and SURF are patented and you are supposed to pay them for its use.
zh: 是的，SIFT和SURF已获得专利，您应该支付它们的使用费用。

source: You can access a pixel value by its row and column coordinates.
zh: 您可以通过行和列坐标访问像素值.

source: You can add two images by OpenCV function, cv.add() or simply by numpy operation, res = img1 + img2.
zh: 你可以加两个图片用OpenCV 函数， cv.add() 或 简单用数组操作， res = img1 + img2.

source: You can consider histogram as a graph or plot, which gives you an overall idea about the intensity distribution of an image.
zh: 您可以将直方图视为图形或绘图，它可以让您全面了解图像的强度分布.

source: You can deduct from the above graph that, blue has some high value areas in the image (obviously it should be due to the sky)
zh: 您可以从上图中扣除，蓝色在图像中有一些高值区域（显然应该是由于天空）

source: You can do it simply by:
zh: 你可以简单地通过这样做:

source: You can modify the pixel values the same way.
zh: 您可以以相同的方式修改像素值.

source: You can see the different results but consider that each algorithm have additional extra parameters that you should fit to get your desired outcome.
zh: 您可以看到不同的结果，但考虑到每个算法都有额外的额外参数，您应该适合获得所需的结果.

source: You can see the image and its histogram.
zh: 你将看到图片和直方图

source: You can visit the CMM webpage on watershed to understand it with the help of some animations.
zh: 有可以访问 CMM webpage on watershed 在一些动画的帮助下理解它.

source: You continue the work of filling water and building barriers until all the peaks are under water.
zh: 你继续填补水和建筑障碍的工作，直到所有的山峰都在水下.

source: You need not use calcHist() or np.histogram() function to find the histogram.
zh: 你不需要使用 calcHist() 或者 np.histogram() 函数计算直方图

source: You start filling every isolated valleys (local minima) with different colored water (labels).
zh: 你开始用不同颜色的水（标签）填充每个孤立的山谷（局部最小值）.

source: You will get a plot as below :
zh: 你将获得下面的图：

source: You will learn these functions : cv.add(), cv.addWeighted() etc.
zh: 你将学习下面的函数： cv.add(), cv.addWeighted() etc.

source: You will need only 16 values to represent the histogram.
zh: 您只需要16个值来表示直方图.

source: You will see these functions : cv.calcHist(), np.histogram() etc.
zh: 您将看到这些功能： cv.calcHist(), np.histogram() etc.

source: You will see these functions : cv.findContours(), cv.drawContours()
zh: 你将弄明白这些函数 : cv.findContours(), cv.drawContours()

source: You will then become an open source contributor :-)
zh: 然后，您将成为开源贡献者 :-)

source: channels : it is also given in square brackets.
zh: channels :它也在方括号中给出。

source: computes the connected components labeled image of boolean image
zh: 计算标记为布尔图像的图像的连通分量

source: const
zh: 常量

source: const Mat &
zh: 常量Mat &

source: cv::Tracker Class Referenceabstract
zh: cv::Tracker Class Reference抽象

source: destination image of the same size and type as src.
zh: 跟源图片相同的尺寸和类型.

source: epsilon - Required accuracy
zh: epsilon - 精度要求

source: hist is a 256x1 array, each value corresponds to number of pixels in that image with its corresponding pixel value.
zh: hist是256x1数组，每个值对应于该图像中具有相应像素值的像素数。

source: hist is same as we calculated before.
zh: hist与我们之前计算的相同。

source: histSize : this represents our BIN count.
zh: histSize : 这代表了我们的BIN计数。

source: http://www.mathworks.in/help/images/ref/regionprops.html
zh: http://www.mathworks.in/帮助/images/ref/regionprops.html

source: ie you need 256 values to show the above histogram.
zh: 即你需要256个值来显示上面的直方图。

source: iiiiii|abcdefgh|iiiiiii with some specified i
zh: iiiiii|abcdefgh|iiiiiii 用一些指定的i

source: images : it is the source image of type uint8 or float32.
zh: images : 源图片，数据类型 uint8 或者 float32。

source: img.dtype is very important while debugging because a large number of errors in OpenCV-Python code is caused by invalid datatype.
zh: img.dtype在调试时非常重要，因为OpenCV-Python代码中的大量错误是由无效的数据类型引起的.

source: it should be given in square brackets, ie, "[img]".
zh: 它应该放在方括号中，例如, "[img]"。

source: mask : mask image.
zh: mask : 掩码图片。

source: max_iter - An integer specifying maximum number of iterations.
zh: max_iter - 一个指定最大迭代次数的整数。

source: ranges : this is our RANGE.
zh: ranges : 这是值域.

source: say for example, you need to find the number of pixels lying between 0 to 15, then 16 to 31, ..., 240 to 255.
zh: 例如，你需要找到介于0到15之间，然后是16到31，......，240到255之间的像素数。

source: source 8-bit single channel image.
zh: 8位单通道图片.

source: static Ptr< _Tp >
zh: 静态的 Ptr< _Tp >

source: template<typename _Tp >
zh: 模板<typename _Tp >

source: the GOTURN (Generic Object Tracking Using Regression Networks) tracker
zh: the GOTURN (Generic Object Tracking Using Regression Networks) 追踪器

source: the MOSSE (Minimum Output Sum of Squared Error) tracker
zh: the MOSSE ( Minimum Output Sum of Squared Error)追踪器

source: the Median Flow tracker
zh: the Median Flow 追踪器

source: the TLD (Tracking, learning and detection) tracker
zh: the GOTURN (Generic Object Tracking Using Regression Networks) 追踪器

source: type of termination criteria.
zh: 终止标准的类型。

source: warning
zh: 警告
